"""
      ئوخشاش بولمىغان subClass  ،
       ئوخشاش بىر ParentClass ئىچىدىكى methods لارنى ئىشلەتكەن ۋاقىتتا ھاسىل قىلىپ چىقارغان نەتىجە ئوخشىمايدۇ

       نىمە ئۈچۈن ئوخشاش بىر parantClass ئوخشاش بولمىغان نەتىجىنى ھاسىل قىلدۇ

       مەسلەن بۇ يەردە پروگراممىر ۋە لاھىيلىگۈچىدىن ئىباررەت ئىككى class بار ، يەنى designerClass ۋە programmerClass

       دادا تۈر يەنى parentClass دا يېزىلغان work دەپ نام قويغان نىمە خىزمەت قىلدىغىننى ئېىنىقلايدىغان  بىر method بار

       يەنى programmerClass بۇنى ئىشلىتپ پروگرمما تۈزىدۇ ، لاھىلگۈچى designerClass بۇنى ئىشلتىپ لاھىيە تۈزىدۇ


"""