#!/usr/bin/env python
# -*- coding:utf-8 -*-
#@Time  : 2019/12/7 0007 上午 10:51
#@Author: qaytix
#@File  : demo01.py

# ئا: python دا ئۆزگەرگۈچى مىقدار ئىپادىلگەندە ، ئۆزگەرگۈچى مىقدارنىڭ type نى ئىنقلاشنىڭ ھاجىتى يوق
x=1;
y=1;
z=x+y;
print(z);#2
# ئې: string تىپدىكى قىممەت ئىنقلاش
str="HelloWorld";
print(str);#HelloWorld
#ئې: ئۇزۇنلۇقى غا ئېرىشىش
len=len(str);#10
print(len);
#ئې:string تىپدىكى مەزمۇننىڭ نۆلىنچى باشلنىش ئىندىكسنى ئېلىش
first=str[0];
print(first)#H
#ئې: string تىپدىكى مەزمۇننىڭ بىرىنچى ئۇرۇندىن تۆتىنچى ئۇرۇنغىچە بولغان قىممەتكە ئېرىشىش ، تۆتىنچى ئۇرۇندىكى قىممەتنى ئالمايدۇ
center=str[1:4];
print(center);#ell
str1="Java";
str2="Script";
str3=str1+str2;
#ئې : ئىككى دانە string نى ئۇلاش
print(str3);#JavaScript
# ئې : ئالدىدىكى string شەكلدىكى ھەرىپنى ئۈچ قېتىم تەكرارلاپ چىقرىڭ
str4=str1*3;
print(str4);#JavaJavaJava
#  ئې: راسىت ياكى يالغان قايتىدۇ  , مەلۇم بىر ئىلمىنىت  تۆۋەندە كۆرستىلگەن مەزمۇننىڭ ئىچدە بارمۇ يوق شۇنىڭغا ھۈكۈم قىلدۇ
str5='J' in str4;
print(str5);#True بار بولسا
#ئ: string شەكلدىكى number قىمەتتىن ئەڭ چوڭ قىممەتنى تېىڭ
str6="123456";
maxValue=max(str6);
print(maxValue);#6
# ئ: ئەڭ كىچىك قىممەتكە ئېرشىش
minValue=min(str6);
print(minValue);
#ئ: ئىچكى ساقلىغۇچتا ساقلانغان ئادىرس
print(id(minValue));# ئ: ھەرقېتىم بىر مىقدارنىڭ قىممىتى داۋاملىق ئۆزگەرگەندە ئۇنىڭ ئىچكى ساقلىغۇچتىدىكى ئادىرىس ئوخشىمايدۇ
# ئې : tulpe شەكلدىكى قىممەت ئدەتتە مۇقىم شەكلدە ساقلىندۇ ، ئىچدىكى قىممەتنى ئۆزگەرتىشكە بولمايدۇ ، مەسلەن "t[0]="Add
t=("name","age","gender");# ئ: tulpe غا قىممەت ساقلاشقا بولىدۇ ، ئەمما ئۆزگەرتىشكە بولمايدۇ ، پەقەتلا ئۇقۇپ چىقىشقا بولدۇ
print(t[0])#name
name,age,gender=t;# ئې : بۇ es6 دىكى Object دىن قىممەت ئالغان قىممەتنى ئۆزگەرگۈچى مىقدارغا تەقسىملەشنى كۆرستىدۇ
print(name);#name




