#!/usr/bin/env python
# -*- coding:utf-8 -*-
#@Time  : 2019/12/8 0008 下午 15:22
#@Author: qaytix
#@File  : demo2.py

"""
    ئې: start بولسا باشلنىش قىممىتى ، ئادەتتە قىممەت بەرمىگەن دە نورمال ئەھۋالدا 0 نۆل بولىدۇ 
     ئې : end بولسا ئاخىرقى قىممەت يەنى list.length نى كۆرستدۇ ، يەنى ئايلىنىش قېتىم سانىنى كۆرستىدۇ  
    ئې: step بولسا قەدەم ئارلىقنى كۆرستىدۇ 
     range(start,end,step)
"""
print(range(10));#range(0, 10)
print(list(range(10)))# [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
print(list(range(0,10,2)));#[0, 2, 4, 6, 8] چۈنكى 0 دىن 9 غىچە بولغان ساننى ئۆز ئىچىگە ئالىدۇ

print("计算 1+2+...+100 的结果为：");

"""
    ئې : i نىڭ قىممىتى 0 دىن باشلىنپ range فونكىسيەنىڭ كەيندىكى قوش چىكىت ئاستىدىكى جۈمىلە ئىجرا بولىدۇ
    ئې: بۇ ۋاقىتتا i=0; sum=0; sum=sum+i; چىققان نەتىجە sum=0 ، تۇنجى قېتىملىق بىرىنچى  ئايلانما تۈگىدى
    ئىككى : i نىڭ قىممىتى 1 غا ئۆزگەردى ، range فونكىسيەنىڭ كەيندىكى قوش چىكىت ئاستىدىكى جۈمىلە ئىجرا بولىدۇ
    ئې: بۇ ۋاقىتتا i=1; sum=0;sum=sum+i; چىققان نەتىجە  sum=1 ، ئىككىنچى ئايلانما تۈگىدى 
"""
sum=0;
for i in range(101):
    print(i)
    sum+=i;
print(sum);#5050

