"""
 شەرىت جۈمىلسى

    سانجى ئىنىستوتى 2020 يىللىق مەكتەپنىڭ تەبئىي پەن كەسپنىڭ ئەڭ تۆۋەن نۇمۇر چىكنى ئېلان قىلدى .
                            مەكتەپنىڭ ئوقۇغۇچى قۇبۇل قىلىشتىكى شەرتى تۆۋەندىكدەك :
    ئەگەر ئۇقۇغۇچى ئىرىشكەن نۇمۇر 390 دىن يۇقىرى بولسا ، بىزنىڭ مەكتەپكە كىرىپ ئوقالايدۇ , ئۇنداق بولمىسا ئوقامايدۇ.

"""

score=input("ئۇقۇغۇچنىڭ ئىرىشكەن نۇمۇرى :")
score=int(score)

if score>390:#false
    print("بىزنىڭ مەكتەپكە كىرىپ ئوقالايدۇ")
else:
    print("ئۇنداق بولمىسا ئوقامايدۇ")

print("ok")