file_name="test1.txt"
"""
    ھۆججەتنىڭ ئادىرسنى كۆرسىتىپ بېرىمىز ، قانداق مەشغۇلات شەكلى قىلدىغنمىزنى دەيمىز 
"""
fiel1=open(file_name,mode="r")
"""
    بىز ھۆججەتنى ئۇقۇغان ياكى يازغاندا ئەڭ ئاۋال ھۆججەتنىڭ ئادىرىس مۇندەرىجىسنى ئىزدەپ تاپىمىز .
    ئاندىن ھۆججەتنى ئاچىمىز، ئاندىن  ئۇقۇش ياكى يېزشى  مەشغۇلاتى قىلىمىز .
    
    ئادىرستىكى ھۆججەتنى ئاچقاندا بىز ئۆزىمىزنىڭ قىلماقچى بولغان مەشغۇلاتىمىزنىمۇ ئەسكەرتىپ قۇيىشمىز كېرەك ، يەنى ئوقامدۇق ياكى يازامدۇق دەپ .
    ئاندىن ماس فونكىسيلەرنى ئىشلىتىپ ئۇقۇش ياكى يېزىش مەشغۇلاتىنى قىلساق بولىدۇ 
"""
read=fiel1.read() # ھۆججەتنى ئۇقۇيمىز
print(read)
fiel1.close()# ھۆججەتنى ئۇقۇپ بۇلۇپ ئىتىش

